In [1]:
import pandas as pd
import numpy as np

In [2]:
grocerise = pd.Series(index= ["Egg", 'Apple', 'Milk', 'Meat'], data= [14, 5, 'Yes', 'a bit'])
grocerise

Egg         14
Apple        5
Milk       Yes
Meat     a bit
dtype: object

In [3]:
grocerise.shape

(4,)

In [4]:
grocerise.ndim # shows dimention

1

In [5]:
grocerise.size

4

In [6]:
grocerise.index

Index(['Egg', 'Apple', 'Milk', 'Meat'], dtype='object')

In [7]:
grocerise.values

array([14, 5, 'Yes', 'a bit'], dtype=object)

In [8]:
'Apple' in grocerise

True

In [9]:
grocerise[['Apple','Meat']]
grocerise[-1] # get single indece
grocerise[[1,2]] # get multiple indeces
grocerise.loc[['Apple','Egg']]
grocerise.iloc[[1,2]]

Apple      5
Milk     Yes
dtype: object

In [10]:
grocerise['Meat'] = 'A lot'
grocerise

Egg         14
Apple        5
Milk       Yes
Meat     A lot
dtype: object

In [11]:
grocerise.drop('Meat')

Egg       14
Apple      5
Milk     Yes
dtype: object

In [12]:
print(grocerise)
print('........... after .............')
grocerise.drop('Meat', inplace= True)
print(grocerise)

Egg         14
Apple        5
Milk       Yes
Meat     A lot
dtype: object
........... after .............
Egg       14
Apple      5
Milk     Yes
dtype: object

In [13]:
fruites = pd.Series(index=['Apple', 'Orange', 'Banana'], data=[4,3,2])
fruites

Apple     4
Orange    3
Banana    2
dtype: int64

In [14]:
fruites ** 2

Apple     16
Orange     9
Banana     4
dtype: int64

In [15]:
np.sqrt(fruites)
np.exp(fruites)
np.power(fruites, 2)
fruites

Apple     4
Orange    3
Banana    2
dtype: int64

In [16]:
fruites.loc[['Apple', 'Orange']] *3

Apple     12
Orange     9
dtype: int64

In [17]:
grocerise

Egg       14
Apple      5
Milk     Yes
dtype: object

In [18]:
grocerise * 2

Egg          28
Apple        10
Milk     YesYes
dtype: object

In [19]:
items = {
    'Salman': pd.Series( data= [1,2,3,4], index= ['one', 'two', 'three', 'four']),
    'Bob': pd.Series( data= [4,5,6,7], index= ['four', 'five', 'six', 'seven'])
}

type(items)

dict

In [20]:
cards = pd.DataFrame(items)

In [21]:
cards.index

Index(['five', 'four', 'one', 'seven', 'six', 'three', 'two'], dtype='object')

In [22]:
cards.columns

Index(['Salman', 'Bob'], dtype='object')

In [23]:
cards.values
cards.ndim
cards.shape
cards.size

14

In [24]:
salman_items = pd.DataFrame(items, index=["four"], columns= ['Salman'])
salman_items

      Salman
four       4

In [25]:
dictionary = {
    'Integer' : [1,2,3,4,5],
    'float' :   [4.3,2.2,5.3,3.2, 1.1]    
}

In [26]:
pd.DataFrame(dictionary, index= ['zero', 'one', 'two', 'three', 'four'])

       Integer  float
zero         1    4.3
one          2    2.2
two          3    5.3
three        4    3.2
four         5    1.1

In [27]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [28]:
store_items = pd.DataFrame(items2, index=['Deep-class', 'Smart-Drug'])
store_items

            bikes  pants  watches  glasses
Deep-class     20     30       35      NaN
Smart-Drug     15      5       10     50.0

In [29]:
store_items.loc[['Deep-class']] # here is for getting the row
store_items.iloc[[1]]
store_items['bikes']['Deep-class'] # Gets bikes of Deep-class

20

In [30]:
store_items['shirt']=[12,24] # it'll add shirts to store_items
store_items

            bikes  pants  watches  glasses  shirt
Deep-class     20     30       35      NaN     12
Smart-Drug     15      5       10     50.0     24

In [31]:
store_items['glassador'] = store_items['bikes'] + store_items['shirt'] # make glassador = bikes + shirts
store_items

            bikes  pants  watches  glasses  shirt  glassador
Deep-class     20     30       35      NaN     12         32
Smart-Drug     15      5       10     50.0     24         39

In [32]:
new_item_list = {'bikes': 180, 'pants': 320, 'watches': 800, 'glasses': 1320, 'shirt': 890, 'glassador': 980}

In [33]:
salman_store = pd.DataFrame(new_item_list, index= ['Salman-Shop'])
salman_store

             bikes  pants  watches  glasses  shirt  glassador
Salman-Shop    180    320      800     1320    890        980

In [34]:
store_items=  store_items.append(salman_store) # we have to assign it

In [35]:
store_items

             bikes  pants  watches  glasses  shirt  glassador
Deep-class      20     30       35      NaN     12         32
Smart-Drug      15      5       10     50.0     24         39
Salman-Shop    180    320      800   1320.0    890        980

In [36]:
store_items['shoe-online'] = store_items['bikes'][1:]
store_items # make shoe-online column and adds from 1 to n quantity of bikes

             bikes  pants  watches  glasses  shirt  glassador  shoe-online
Deep-class      20     30       35      NaN     12         32          NaN
Smart-Drug      15      5       10     50.0     24         39         15.0
Salman-Shop    180    320      800   1320.0    890        980        180.0

In [37]:
store_items.insert(6,'hat-online',[23,89, 5003])
store_items # makes new column in 6th position and it's values is 23,89,5003

,bikes,pants,watches,glasses,shirt,glassador,hat-online,shoe-online
Deep-class,20,30,35,NaN,12,32,23,NaN
Smart-Drug,15,5,10,50.0,24,39,89,15.0
Salman-Shop,180,320,800,1320.0,890,980,5003,180.0

In [38]:
store_items.pop('glassador') # pop only deletes column
store_items

             bikes  pants  watches  glasses  shirt  hat-online  shoe-online
Deep-class      20     30       35      NaN     12          23          NaN
Smart-Drug      15      5       10     50.0     24          89         15.0
Salman-Shop    180    320      800   1320.0    890        5003        180.0

In [39]:
store_items = store_items.drop(['bikes','glasses'], axis=1)
store_items # it'll drop bikes and glasses , axis 1 means we wanna target columns

             pants  watches  shirt  hat-online  shoe-online
Deep-class      30       35     12          23          NaN
Smart-Drug       5       10     24          89         15.0
Salman-Shop    320      800    890        5003        180.0

In [40]:
store_items = store_items.drop(['Smart-Drug'], axis = 0) #it'll delete smart drug <Row> if axis is 0
store_items

             pants  watches  shirt  hat-online  shoe-online
Deep-class      30       35     12          23          NaN
Salman-Shop    320      800    890        5003        180.0

In [41]:
store_items = store_items.rename(columns = {'hat-online': 'hat', 'shoe-online': 'shoe'})
store_items

             pants  watches  shirt   hat   shoe
Deep-class      30       35     12    23    NaN
Salman-Shop    320      800    890  5003  180.0

In [42]:
store_items = store_items.rename(index = {'Deep-class': 'Hoosh-academy'})
store_items # for spacifying the row to be renamed we use the term index

               pants  watches  shirt   hat   shoe
Hoosh-academy     30       35     12    23    NaN
Salman-Shop      320      800    890  5003  180.0

In [43]:
store_items = store_items.set_index('hat') # i used hat[which is a column] values to set index
store_items # look carefully now the name index[0] is 23 and the name index[1] is 5003

      pants  watches  shirt   shoe
hat
23       30       35     12    NaN
5003    320      800    890  180.0

In [44]:
print('*********************************************')

*********************************************

In [45]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [46]:
store_items.isnull()# makes dataframe of true and falses
nulls = store_items.isnull().sum()# gives sum of nulls in each column
nulls = store_items.isnull().sum().sum() # the second sum gives total nulls of all columns
nulls

3

In [47]:
store_items.count() # gives count of (not non values) each column
store_items.count().sum() # gives total values ( non values are excluded)

18

In [48]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [49]:
store_items = store_items.dropna(axis = 1) # it will drop all columns which has non values (for rows use axis=0)
# store_items.dropna(axis = 1, inplace= True) notice that i did'nt reinitialized store_items again
store_items #

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [50]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [51]:
store_items.fillna(0, inplace= True) # i don't like to reinitialize it, so i used inplace = True
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [52]:
store_items.fillna(method= 'ffill', axis = 0)
#It will fill non values with previous values (axis = 0 means previous columns and axis = 1 is previous row)
#Notice the glasses 1st values is still nan cuz it doesn't have previous value

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [53]:
store_items.fillna(method= 'backfill', axis = 0) # it will fill with it's next value

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [56]:
store_items.interpolate(method = 'linear', axis=1)
# intilizes nan value (with next * before / 2) in any axis we spacify

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      0.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0     0.0   10.0    0.0      4.0

In [60]:
#Comma Separated Values and offers a simple format to store data. We can load CSV files into Pandas DataFrames using the pd.read_csv() function. Let's load Google stock data into a Pandas DataFrame. The GOOG.csv file contains Google stock data from 8/19/2004 till 10/13/2017 taken from Yahoo Finance.

# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('./goog.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (1258, 8)

In [65]:
df = pd.DataFrame(Google_stock)

In [66]:
df.head(3)

    Sym      Date    Open    High     Low   Close   Volume  Adj Close
0  GOOG  4/7/2010  567.30  568.75  561.86  563.54  2581000     563.54
1  GOOG  4/6/2010  569.46  570.89  565.40  568.22  2060100     568.22
2  GOOG  4/5/2010  570.90  574.88  569.00  571.01  1901500     571.01

In [64]:
df.tail(10)

       Sym       Date    Open    High     Low   Close    Volume  Adj Close
1248  GOOG  4/21/2005  200.42  205.00  199.32  204.22  17751900     204.22
1249  GOOG  4/20/2005  198.58  200.50  195.91  198.10  15451500     198.10
1250  GOOG  4/19/2005  189.33  192.00  188.03  191.40   8430000     191.40
1251  GOOG  4/18/2005  184.58  187.88  183.49  186.97   6550300     186.97
1252  GOOG  4/15/2005  190.10  190.34  184.66  185.00  11577400     185.00
1253  GOOG  4/14/2005  193.27  194.36  190.10  191.45   6152700     191.45
1254  GOOG  4/13/2005  193.47  194.32  189.73  192.93   6555800     192.93
1255  GOOG  4/12/2005  193.00  194.42  189.41  193.96   7319600     193.96
1256  GOOG  4/11/2005  193.09  194.80  192.32  193.23   5410500     193.23
1257  GOOG   4/8/2005  193.69  195.10  191.45  192.05   5116600     192.05

In [70]:
df.isnull().any() # check do we have any null value.
# if it finds the first null it won't go further to counting other

Sym          False
Date         False
Open         False
High         False
Low          False
Close        False
Volume       False
Adj Close    False
dtype: bool

In [72]:
df.describe()

,Open,High,Low,Close,Volume,Adj Close
count,1258.000000,1258.000000,1258.000000,1258.000000,1.258000e+03,1258.000000
mean,446.004921,451.368219,440.065882,445.695779,6.492043e+06,445.695779
std,107.252863,107.588823,106.320282,106.916954,4.485054e+06,106.916954
min,184.580000,187.880000,183.490000,185.000000,8.587000e+05,185.000000
25%,374.730000,380.707500,369.230000,374.260000,3.636450e+06,374.260000
50%,447.580000,453.330000,441.910000,445.915000,5.473650e+06,445.915000
75%,519.257500,523.595000,513.030000,517.952500,7.887375e+06,517.952500
max,741.130000,747.240000,725.000000,741.790000,4.111670e+07,741.790000

In [75]:
df['Volume'].describe() # it will describe on Volume column

count    1.258000e+03
mean     6.492043e+06
std      4.485054e+06
min      8.587000e+05
25%      3.636450e+06
50%      5.473650e+06
75%      7.887375e+06
max      4.111670e+07
Name: Volume, dtype: float64

In [76]:
df.max()

Sym              GOOG
Date         9/9/2009
Open           741.13
High           747.24
Low               725
Close          741.79
Volume       41116700
Adj Close      741.79
dtype: object

In [77]:
df.mean()

Open         4.460049e+02
High         4.513682e+02
Low          4.400659e+02
Close        4.456958e+02
Volume       6.492043e+06
Adj Close    4.456958e+02
dtype: float64

In [78]:
df['Close'].mean()

445.69577901430847

In [79]:
df['Low'].min()

183.49

In [81]:
df.corr()

               Open      High       Low     Close    Volume  Adj Close
Open       1.000000  0.998883  0.998366  0.997280 -0.339888   0.997280
High       0.998883  1.000000  0.998048  0.998610 -0.331654   0.998610
Low        0.998366  0.998048  1.000000  0.998825 -0.357460   0.998825
Close      0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000
Volume    -0.339888 -0.331654 -0.357460 -0.344796  1.000000  -0.344796
Adj Close  0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000

In [86]:
fake = pd.DataFrame(pd.read_csv('fake_company.csv'))

In [94]:
fake

   Year     Name Department  Age  Salary\t
0  1990    Alice         HR   25     50000
1  1990      Bob         RD   30     48000
2  1990  Charlie      Admin   45     55000
3  1991    Alice         HR   26     52000
4  1991      Bob         RD   31     50000
5  1991  Charlie      Admin   46     60000
6  1992    Alice         HR   27     60000
7  1992      Bob         RD   32     52000
8  1992  Charlie      Admin   47     62000

In [110]:
fake.groupby(['Name'])['Department'].mean()

DataError: No numeric types to aggregate